In [5]:
import pandas as pd

In [6]:
df = pd.read_excel("../input/Name List WA Blast.xlsx")
df.head()

  Contact/First Name Contact/Last Name Contact/Mobile
0                NaN               NaN    0818 755187
1             Paulus                NG     0898 30160
2            Suharno               Tan    0818 961838
3              Aswin               NaN  0812 87165082
4        Christopher               NaN  0859 21448693

In [7]:
# Remove all whitespaces
df['Contact/Mobile'] = df['Contact/Mobile'].str.replace(' ', '')
# Add +62 prefix to all Contact/Mobile numbers
# Remove the first "0" if it exists
df['Contact/Mobile'] = df['Contact/Mobile'].str.lstrip('0')

# Add +62 prefix to all Contact/Mobile numbers
df['Contact/Mobile'] = '+62' + df['Contact/Mobile']
df.head()

  Contact/First Name Contact/Last Name  Contact/Mobile
0                NaN               NaN    +62818755187
1             Paulus                NG     +6289830160
2            Suharno               Tan    +62818961838
3              Aswin               NaN  +6281287165082
4        Christopher               NaN  +6285921448693

In [ ]:
df.to_excel("../input/fixed_df.xlsx", index=False)